/* Description for disconnection warning setting */
"1 Minute Alert Before Disconnection" = "Alerta de 1 Minuto Antes de Desconectar";

/* Error string for OTR message string */
"A private conversation could not be set up." = "A private conversation could not be set up.";

/* Title for the about page */
"About" = "Sobre";

/* Label for button to show version numbers and licenses */
"About This Version" = "About This Version";

/* SSL error message */
"Access denied" = "Acesso negado";

/* The string describing a buddy's account */
"Account" = "Conta";

/* Error title when account is disconnected */
"Account Disconnected" = "Account Disconnected";

/* Title for showing the users account otr fingerprints */
"Account Fingerprints" = "Account Fingerprints";

/* Title for the accounts tab */
"Accounts" = "Contas";

/* Button title to add someone as a buddy */
"Add" = "Adicionar";

/* The title for the view to add a buddy */
"Add Buddy" = "Adicionar Contacto";

/* String to describe advanced set of settings */
"Advanced" = "Avançado";

/* Error string for OTR message string */
"An error occured while encrypting a message and the message was not sent." = "An error occured while encrypting a message and the message was not sent.";

/* shown when changing database passphrase fails */
"An error occurred while changing the database passphrase." = "An error occurred while changing the database passphrase.";

/* Error message when setting up database */
"An error occurred while setting up the database." = "An error occurred while setting up the database.";

/* SSL error message */
"Attempt to restore an unknown session" = "Tentativa de restaurar uma sessão desconhecida";

/* Title for automatic conversation deletion setting */
"Auto-delete" = "Auto-eliminar";

/* string for title yes/no setting for allowing opportunistic otr */
"Auto-start Encryption" = "Auto-iniciar Encriptação";

/* Label in buddy list for users that are available */
"Available" = "Disponível";

/* Label in buddy list for users that are away */
"Away" = "Ausente";

/* Message displayed in Notification Manager when session will expire in one minute */
"Background session will expire in one minute." = "A sessão de fundo vai expirar em um minuto.";

/* SSL error message */
"Bad certificate format" = "Mau formato de certificado";

/* SSL error message */
"Bad MAC" = "Mau MAC";

/* SSL error message */
"Bad protocol version" = "Má versão do protocolo";

/* SSL error message */
"Bad SSLCipherSuite" = "Má SSLCipherSuite";

/* SSL error message */
"Bad unsupported cert format" = "Mau formato de certificado não-suportado";

/* string to describe basic set of settings */
"Basic" = "Básico";

/* Text describing what happens when the user has forgotten the passphrase */
"Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords." = "Because the database contents is encrypted with your passphrase, you've lost access to your data and will need to delete and reinstall ChatSecure to continue. Password managers like 1Password or MiniKeePass can be helpful for generating and storing strong passwords.";

/* The String for a button to block a buddy */
"Block" = "Bloquear";

/* The String for a buddy to block and remove a buddy from the buddy list */
"Block & Remove" = "Bloquear & Remover";

/* Title for showing the users buddies otr fingerprints */
"Buddy Fingerprints" = "Buddy Fingerprints";

/* The title for the view that shows detailed buddy info */
"Buddy Info" = "Informação do Contacto";

/* Title for the buddy list tab */
"Buddy List" = "Lista de Contactos";

/* Cancel an alert window */
"Cancel" = "Cancelar";

/* Shown when ending an encrypted chat session */
"Cancel Encrypted Chat" = "Cancelar Conversa Encriptada";

/* Error string for OTR message string */
"Cannot read the received message." = "Cannot read the received message.";

/* Error string for OTR message string */
"Cannot recognize the type of OTR message received." = "Cannot recognize the type of OTR message received.";

/* SSL error message */
"Cert chain not verified by root" = "A corrente de certificados não foi verificada por root";

/* SSL error message */
"Certificate expired" = "O certificado expirou";

/* SSL error message */
"Certificate revoked" = "O certificado foi revogado";

/* SSL error message */
"Chain had a cert not yet valid" = "A corrente tinha um certificado que ainda não é válido";

/* SSL error message */
"Chain had an expired cert" = "A corrente tinha um certificado expirado";

/* Title for button to change encrypted database passphrase */
"Change Passphrase" = "Change Passphrase";

/* Title for chat view */
"Chat" = "Conversa";

/* Body of SMS or email when sharing a link to the app */
"Chat with me securely" = "Converse comigo em segurança";

/* Title for chats view */
"Chats" = "Chats";

/* Title for ChatSecure Push (this probably doesnt need to be translated) */
"ChatSecure Push" = "ChatSecure Push";

/* let users know source is on Github */
"Check out the source here on Github" = "Verifique o código fonte aqui no Github";

/* SSL error message */
"Cipher Suite negotiation failure" = "Erro de negociação da Cipher Suite";

/* Label for text field where you compose a new message */
"Compose" = "Compose";

/* SSL error message */
"Configuration error" = "Erro de configuração";

/* Button label for connecting a Facebook account */
"Connect Facebook" = "Ligar ao Facebook";

/* Label for button to create account by logging into an existing account */
"Connect to Existing Account" = "Connect to Existing Account";

/* Whether or not account is logged in */
"Connected" = "Ligado";

/* String to state if an account is progress of creating a connection */
"Connecting" = "Connecting";

/* Message shown when connecting to the Tor network */
"Connecting to Tor" = "Connecting to Tor";

/* SSL error message */
"Connection closed gracefully" = "Ligação terminada graciosamente";

/* SSL error message */
"Connection closed via error" = "Ligação terminada por erro";

/* Copy string to clipboard as in copy and paste */
"Copy" = "Copy";

/* Error message when cannot get public key from SSL certificate */
"Could not retrieve public key from certificate" = "Could not retrieve public key from certificate";

/* Title for button to create account */
"Create" = "Create";

/* Label for button to create a new account via in band registration */
"Create New Account" = "Create New Account";

/* Start of sentence that will be followed by names */
"Created by" = "Created by";

/* Title for progress of creating a new account */
"Creating Account" = "Creating Account";

/* title label for the existing passphrase */
"Current Passphrase" = "Current Passphrase";

/* SSL error message */
"Decoding error" = "Erro de descodificação";

/* SSL error message */
"Decompression failure" = "Falha de descompressão";

/* SSL error message */
"Decryption error" = "Erro de desencriptação";

/* SSL error message */
"Decryption failed" = "A desencriptação falhou";

/* SSL error message */
"Decryption failure" = "Falha de desencriptação";

/* default string to revert to normal language behaviour */
"Default" = "Definição Padrão";

/* Ask user if they want to delete the stored account information */
"Delete Account?" = "Apagar Conta?";

/* Description for automatic conversation deletion */
"Delete chats on disconnect" = "Apagar conversas ao desligar";

/* Shows in the chat view when a message has been delivered */
"Delivered" = "Entregue";

/* button label for disconnecting Facebook account */
"Disconnect Facebook" = "Desligar do Facebook";

/* Default message when a user status is set to do not disturb */
"Do Not Disturb" = "Não Perturbar";

/* Error message when domain textfield left blank */
"Domain needs to be set" = "Domain needs to be set";

/* Message when port is changed but domain not set */
"Domain needs to be set manually when specifying a custom port" = "O domínio precisa ser definido manualmente depois de especificar uma porta personalizada";

/* Title for donation link */
"Donate" = "Doar";

/* Title for button to press when user is finished */
"Done" = "Terminado";

/* Error title when there is a duplicate account */
"Duplicate account" = "Duplicate account";

/* The string describing account name or email address for a buddy */
"Email" = "Email";

/* string for decription yes/no setting for allowing opportunistic otr */
"Enables opportunistic OTR" = "Ligar OTR oportunista";

/* Generic title for encryption errors */
"Encryption Error" = "Encryption Error";

/* title label for error when creating account */
"Error Creating Account" = "Error Creating Account";

/* Error message when registration fails */
"Error Registering Username" = "Error Registering Username";

/* Title of error message pop-up box */
"Error!" = "Erro!";

/* SSL error message */
"Export restriction" = "Restrição de exportação";

/* Default message when a user status is set to extended away */
"Extended Away" = "Ausência Prolongada";

/* the name for facebook */
"Facebook" = "Facebook";

/* Message when cannot connect to XMPP server */
"Failed to connect to XMPP server. Please check your login credentials and internet connection and try again." = "Falhou ao ligar ao servidor XMPP. Por favor verifique as suas credenciais de início de sessão e ligação à internet e volte a tentar.";

/* SSL error message */
"Fatal alert" = "Alerta fatal";

/* your fingerprint */
"Fingerprint for you" = "A sua fingerprint";

/* Label for button when you've forgotten the passphrase */
"Forgot Passphrase?" = "Forgot Passphrase?";

/* Name of popular web based hosting service */
"GitHub" = "GitHub";

/* the name for Google talk */
"Google Talk" = "Google Talk";

/* SSL error message */
"Handshake failure" = "Falha no aperto de mãos";

/* Label for button to open link to translate app */
"Help Translate" = "Help Translate";

/* Label text for hostname field on login scree */
"Hostname" = "Hostname";

/* SSL error message */
"I/O would block (not fatal)" = "I/O would block (não fatal)";

/* SSL error message */
"Illegal parameter" = "Parâmetro ilegal";

/* Message alerting user that they need to return to the home screen and force close ChatSecure */
"In order to change languages return to the home screen and remove ChatSecure from the recently used apps" = "Para mudar de língua regresse ao ecrã inicial e remova o ChatSecure das apps utilizadas recentemente";

/* Short for information, button title to get more information */
"Info" = "Informação";

/* Shown when starting an encrypted chat session */
"Initiate Encrypted Chat" = "Iniciar Conversa Encriptada";

/* SSL error message */
"Insufficient buffer provided" = "Buffer providenciado é insuficiente";

/* SSL error message */
"Insufficient security" = "Segurança insuficiente";

/* SSL error message */
"Internal error" = "Erro interno";

/* SSL error message */
"Invalid certificate chain" = "Cadeia de certificados inválida";

/* title label for invalid email */
"Invalid Email" = "Invalid Email";

/* Directions to the system software update */
"iOS Vulnerability" = "iOS Vulnerability";

/* Message shown in line for users that are available */
"is now available" = "está agora disponível";

/* Message shown in line for users that are away */
"is now away" = "está agora ausente";

/* Message shown in line for users that are offline */
"is now offline" = "está agora offline";

/* the name for jabber, also include (XMPP) at the end */
"Jabber (XMPP)" = "Jabber (XMPP)";

/* string to bring up language selector */
"Language" = "Língua";

/* String of title to alert user language is change */
"Language Change" = "Mudança de Língua";

/* log in to account */
"Log In" = "Iniciar Sessão";

/* log out from account */
"Log Out" = "Terminar Sessão";

/* shown during the login process */
"Logging in..." = "A iniciar sessão...";

/* Label for account setting that autologins on launch */
"Login Automatically" = "Iniciar Sessão Automaticamente";

/* Title for button to manage ChatSecure Push account */
"Manage ChatSecure Push account" = "Manage ChatSecure Push account";

/* Subtitle lable for button to show saved fingerprints */
"Manage OTR fingerprints" = "Manage OTR fingerprints";

/* subtitle for the certificate pinned setting */
"Manage saved SSL certificates" = "Gerir certificados SSL guardados";

/* Error string for OTR message string */
"Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it." = "Message has not been sent because our buddy has ended the private conversation. We should either close the connection, or refresh it.";

/* SSL error message */
"Miscellaneous bad certificate" = "Mau certificado";

/* SSL error message */
"Module attach failure" = "Falha da anexação do módulo";

/* The string describing a buddy's display name */
"Name" = "Nome";

/* For a new settings value */
"New" = "Novo";

/* Title for New Account View */
"New Account" = "Nova Conta";

/* title label for the new passphrase */
"New Passphrase" = "New Passphrase";

/* Title for alert when a new SSL certificate is encountered */
"New SSL Certificate" = "Novo Certificado SSL";

/* Label for button to go to next step */
"Next" = "Next";

/* SSL error message */
"No Error" = "Nenhum Erro";

/* SSL error message */
"No renegotiation allowed" = "Não é permitido renegociar";

/* To let the user know the fingerprint as not been checked */
"Not Verified" = "Não Verificado";

/* Label in buddy list for users that are offline */
"Offline" = "Offline";

/* Accept the dialog */
"OK" = "OK";

/* For an old settings value */
"Old" = "Velho";

/* Label to open link in the chrome web browser */
"Open in Chrome" = "Open in Chrome";

/* Label for button to open link in facebook app */
"Open in Facebook" = "Open in Facebook";

/* Label for button to open link in twitter app */
"Open in Twitter" = "Open in Twitter";

/* Hint text for domain field telling user this field is not required */
"Optional" = "Opcional";

/* the name for AIM */
"OSCAR Instant Messenger" = "Mensageiro Instantâneo OSCAR";

/* Title for other miscellaneous settings group */
"Other" = "Outros";

/* Lable for button to show saved fingerprints */
"OTR Fingerprints" = "OTR Fingerprints";

/* Error string for OTR message string */
"Our policy requires encryption but we are trying to send an unencrypted message out." = "Our policy requires encryption but we are trying to send an unencrypted message out.";

/* Label text for password field on login screen */
"Password" = "Palavra-passe";

/* SSL error message */
"Peer cert is valid, or was ignored if verification disabled" = "O certificado do par é válido, ou foi ignorado se a verificação estiver desligada";

/* SSL error message */
"Peer dropped connection before responding" = "O par perdeu a ligação antes de responder";

/* SSL error message */
"Peer host name mismatch" = "Hostname do par não corresponde";

/* String for XMPP buddies when adding buddy is pending */
"Pending Approval" = "Aguardando Aprovação";

/* Ask user if they want to delete the stored account information */
"Permanently delete" = "Eliminar permanentemente";

/* Button Lable to show all pinned SSL certificates */
"Pinned Certificates" = "Certificados Fixados";

/* detail title label for invalid email */
"Please choose a valid email address" = "Please choose a valid email address";

/* Error description when account is disconnected while managing requests */
"Please log into this account before managing requests." = "Please log into this account before managing requests.";

/* Label for port number field for connecting to service */
"Port" = "Porta";

/* the alleged fingerprint of their other person */
"Purported fingerprint for" = "Suposta fingerprint de";

/* Title for push-messaging related settings */
"Push" = "Push";

/* Label for qr code image */
"QR code" = "QR code";

/* Error string for OTR message string */
"Received a general OTR error." = "Received a general OTR error.";

/* Error string for OTR message string */
"Received a heartbeat." = "Received a heartbeat.";

/* Error string for OTR message string */
"Received an encrypted message but cannot read it because no private connection is established yet." = "Received an encrypted message but cannot read it because no private connection is established yet.";

/* Error string for OTR message string */
"Received an unencrypted message." = "Received an unencrypted message.";

/* Error string for OTR message string */
"Received and discarded a message intended for another instance." = "Received and discarded a message intended for another instance.";

/* Error string for OTR message string */
"Received our own OTR messages." = "Received our own OTR messages.";

/* Title for header of Buddy list view with Recent Buddies */
"Recent" = "Recentes";

/* SSL error message */
"Record overflow" = "Record overflow";

/* Button title to reject a request such as a buddy request */
"Reject" = "Rejeitar";

/* Label for switch to save passphrase */
"Remember Passphrase" = "Remember Passphrase";

/* label for switch for whether or not we should save their password between launches */
"Remember password" = "Recordar a palavra-passe";

/* The String for a button to remove a buddy from the buddy list */
"Remove" = "Remover";

/* Reply to an incoming message */
"Reply" = "Responder";

/* String to let user know a certain field like a password is required to create an account */
"Required" = "Requerido";

/* Label for text input for XMPP resource */
"Resource" = "Resource";

/* Title for button for saving a setting */
"Save" = "Guardar";

/* Title for listing the user saved SSL certificates */
"Saved Certificates" = "Certificados Guardados";

/* Label for text field where you search for a buddy */
"Search" = "Search";

/* Title heading in settings */
"Security" = "Segurança";

/* Title of alert box warning about security issues */
"Security Warning" = "Aviso de segurança";

/* string for settings to allow self signed SSL string */
"Self Signed SSL" = "SSL Auto-Assinado";

/* String on button to email feedback */
"Send Feedback" = "Enviar Feedback";

/* Error string for OTR message string */
"Sent a heartbeat." = "Sent a heartbeat.";

/* SSL error message */
"Server closed session with no notification" = "O servidor terminou a sessão sem notificação";

/* SSL error message */
"Server has requested a client cert" = "O servidor pediu um certificado de cliente";

/* Detail label for button to change encrypted database passphrase */
"Set new database passphrase" = "Set new database passphrase";

/* Title for the Settings screen */
"Settings" = "Definições";

/* Directions to the system software update */
"Settings -> General -> Software Update" = "Settings -> General -> Software Update";

/* Title for sharing a link to the app */
"Share" = "Partilhar";

/* Title for setting about showing a warning before disconnection */
"Sign out Warning" = "Aviso de Término de Sessão";

/* title label for signing up for a new account */
"Sign Up" = "Sign Up";

/* Label for button to skip this step */
"Skip" = "Skip";

/* string for settings to allow SSL mismatch */
"SSL Hostname Mismatch" = "Hostname SSL Não Coincidente";

/* SSL error message */
"SSL protocol error" = "Erro de protocolo SSL";

/* Title of view where you can mange buddy or subscription requests */
"Subscription Requests" = "Pedidos de Subscrição";

/* Title to let user know that encryption is not currently enabled */
"The conversation is not secure" = "The conversation is not secure";

/* Title to let user know that the OTR fingerprint has not been checked */
"The conversation is secure and the fingerprint is verfied" = "The conversation is secure and the fingerprint is verfied";

/* Warn user that the current chat is no longer secure */
"The conversation with %@ is no longer secure." = "A conversa com %@ já não é segura.";

/* shown when changing database passphrase succeeds */
"The database passphrase change was successful." = "The database passphrase change was successful.";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has changed and needs to be verified" = "The fingerprint has changed and needs to be verified";

/* Title to let user know that the OTR fingerprint has not been checked */
"The fingerprint has not been verified" = "The fingerprint has not been verified";

/* Error string for OTR message string */
"The message received contains malformed data." = "The message received contains malformed data.";

/* Error string for OTR message string */
"The previous message was resent." = "The previous message was resent.";

/* Error message for when in band registration is not supported */
"The XMPP server does not support in-band registration" = "The XMPP server does not support in-band registration";

/* Error message when there is a duplicate account */
"There already exists an account with this username." = "There already exists an account with this username.";

/* Warns user that the current chat is secure */
"This chat is secured" = "Esta conversa é segura";

/* Error message when trying to make a purchase but payments haven't been set up yet */
"This device doesn't seem to be configured to make payments." = "This device doesn't seem to be configured to make payments.";

/* Instructions label text underneath QR code */
"This QR Code contains a link to http://omniqrcode.com/q/chatsecure and will redirect to the App Store." = "Este Código QR contém uma ligação para http://omniqrcode.com/q/chatsecure e vai redirecionar para a App Store.";

/* Message for warning about using tor network */
"Tor is an experimental feature, please use with caution." = "Tor is an experimental feature, please use with caution.";

/* Name of the popular social tweeting site */
"Twitter" = "Twitter";

/* SSL error message */
"Underlying cryptographic error" = "Erro criptográfico adjacente ";

/* SSL error message */
"Unexpected (skipped) record in DTLS" = "Registo inesperado (ignorado) em DTLS";

/* SSL error message */
"Unexpected message received" = "Mensagem não esperada recebida";

/* SSL error message */
"Unknown Cert Authority" = "Autoridade Emissora do Certificado Desconhecida";

/* SSL error message */
"Unknown certificate" = "Certificado desconhecido";

/* Label for button to unlock app */
"Unlock" = "Unlock";

/* SSL error message */
"User canceled" = "O utilizador cancelou";

/* Example of a username using the words user and example */
"user@example.com" = "user@example.com";

/* Label text for username field on login screen */
"Username" = "Nome de utilizador";

/* SSL error message */
"Valid cert chain, untrusted root" = "Corrente de certificados válida, origem não confiável";

/* shown to show that the certificate was valid to the system */
"Valid certificate" = "Certificado válido";

/* To let the user know the fingerprint as been checked */
"Verified" = "Verificado";

/* Shown when verifying fingerprints */
"Verify" = "Verificar";

/* Title of the dialog for fingerprint verification */
"Verify Fingerprint" = "Verificar Fingerprint";

/* Shown when verifying fingerprints */
"Verify Later" = "Verificar Depois";

/* when displaying version numbers such as 1.0.0 */
"Version" = "Versão";

/* Warn user that the current chat is not secure */
"Warning: This chat is not encrypted" = "Aviso: Esta conversa não é encriptada";

/* actionsheet for showing uservoice feedback service */
"Would you like to connect to UserVoice to send feedback?" = "Would you like to connect to UserVoice to send feedback?";

/* Title for xmpp accounts that connect through the Tor network */
"XMPP + Tor" = "XMPP + Tor";

/* Inform user that they must be secure their conversation before doing that action */
"You must be in a secure conversation first." = "Precisa de estar numa conversa segura primeiro.";

/* error message shown when user doesn't fill in a username or password */
"You must enter a username and a password to login." = "Precisa introduzir um nome de utilizador e uma palavra-passe para iniciar sessão.";

/* Alert to system issues, leave in the %@ */
"Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible." = "Your current iOS system version (%@) contains a serious security vulnerability. Please update to the latest version as soon as possible.";

/* Message shown when about to donate */
"Your donation will help fund the continued development of ChatSecure." = "A sua doação irá contribuir para o desenvolvimento continuado do ChatSecure.";

/* Text that describes what remembering your passphrase does */
"Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history." = "Your password will be stored in the iOS Keychain of this device only, and is only as safe as your device passphrase or pin. However, it will not persist during a device backup/restore via iTunes, so please don't forget it, or you may lose your conversation history.";

